<a href="https://colab.research.google.com/github/gyujin0450/Rstudy/blob/master/203_%EB%8D%B0%EC%9D%B4%ED%84%B0%EA%B0%80%EA%B3%B5(2)_p48.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

데이터가공(2)

In [ ]:
# dplyr 라이브러리
# 하들리위캄이 만든 패키지 모음 중 하나
# 데이터 처리, 탐색에 빠르고 유용한 기능들을 제공함
# 데이터분석의 사실상 표준으로 받아지고 있음
# install.pakages('dplyr') # 코랩에는 기본적으로 설치됨
library(dplyr)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [ ]:
# select  : 열선택
# filter  : 조건선택
# mutate  : 행/열 추가

# summarise : 데이터 집계
# group_by  : 데이터 그룹화
# arrange   : 데이터 정렬

# 연산 수행시 파이프(>) 패러다임을 이용해서
# 체인 현식으로 연산을 수행할 수 있음
# (예)
# sum(titani, na.rm = T)     # 한번에 수행
# titanic %>% sum(na.rm=T)   # 단계적으로 수행

In [ ]:
# 성적 데이터 로드
load('sungjuk.rdata')
# 총점과 평균을 계산하여 tot, avg 라는 컬럼 생성(방법2)
sungjuk <- within(sungjuk, {
              tot <- eng + mat + sci
              avg <- tot / 3
           })
# 성적 데이터에 반(클래스) 변수 추가
sungjuk$class <-c(1,2,1,2)
sungjuk

  name eng mat sci avg      tot class
1 John 90  85  90  88.33333 265 1
2 Tom  95  96  80  90.33333 271 2
3 Mark 69  49  70  62.66667 188 1
4 Jane 78  95  60  77.66667 233 2

In [ ]:
# select : 열선택
# sungjuk 데이터프레임에서 영어 출력
sungjuk %>% select(eng, mat, sci)

  eng mat sci
1 90  85  90
2 95  96  80
3 69  49  70
4 78  95  60

In [ ]:
# filter : 조건검색
# class가 1인 학생들 출력
sungjuk %>% filter(class == 1)

  name eng mat sci avg      tot class
1 John 90  85  90  88.33333 265 1
2 Mark 69  49  70  62.66667 188 1

In [ ]:
# 영어점수가 70이상이고, 수학 점수 90이상 학생들 출력
sungjuk %>% filter( eng >= 70 & mat >= 90)

  name eng mat sci avg      tot class
1 Tom  95  96  80  90.33333 271 2
2 Jane 78  95  60  77.66667 233 2

In [ ]:
sungjuk %>% filter( eng >= 70, mat >= 90)

  name eng mat sci avg      tot class
1 Tom  95  96  80  90.33333 271 2
2 Jane 78  95  60  77.66667 233 2

In [ ]:
# 영어점수가 70이상이거나 수학 점수 90이상 학생들 출력
sungjuk %>% filter( eng >= 70 | mat >= 90)

  name eng mat sci avg      tot class
1 John 90  85  90  88.33333 265 1
2 Tom  95  96  80  90.33333 271 2
3 Jane 78  95  60  77.66667 233 2

In [ ]:
# 영어점수가 70이상이고, 수학 점수 90이상 학생들의 클래스와 이름만 출력
sungjuk %>% filter( eng >= 70 & mat >= 90) %>% select( class, name )

  class name
1 2     Tom
2 2     Jane

In [ ]:
#성적데이터 초기화
load('sungjuk.rdata')
sungjuk

  name eng mat sci
1 John 90  85  90
2 Tom  95  96  80
3 Mark 69  49  70
4 Jane 78  95  60

In [ ]:
# 영어/수학/과학에 대해 총점/평균을 계산하고
# tot, avg 컬럼에 저장
sungjuk <- sungjuk %>% mutate(tot = eng + mat + sci, avg = round(tot /3,1))
sungjuk

  name eng mat sci tot avg
1 John 90  85  90  265 88.3
2 Tom  95  96  80  271 90.3
3 Mark 69  49  70  188 62.7
4 Jane 78  95  60  233 77.7

In [ ]:
# 조건식 함수 - 강의본(p11)
# ifelse(조건식, 참일때 값, 거짓일때 값)
x <- 55
ifelse(x >= 60, "합격입니다", "불합격입니다")

[1] "불합격입니다"

In [ ]:
 result <- ifelse(x >= 60, "합격입니다", "불합격입니다")
 result

[1] "불합격입니다"

In [ ]:
# 0 ~ 30 : 작음       (x >= 0 & x <= 30 --> x <= 30 처럼 상한선만 씀)
# 31~ 60 : 보통       (x >= 31 & x <= 60 --> x <= 60 처럼 상한선만 씀) 
# 61 ~ 100 : 잘했음   (x >= 61 & x <= 100 --> x <= 100 처럼 상한선만 씀) 
ifelse(x <= 30, '작음', ifelse( x <= 60, '보통', '잘했음'))

[1] "보통"

In [ ]:
# 학점 ABCDF 을 계산하는 조건식
# ifelse 함수로 작성
# (90/80/70/60/~ : A/B/C/D/F)
x <- 100
# ifelse( x <= 59, "F", ifelse( x <= 69, "D", ifelse( x <= 79, "C", ifelse( x <= 89, "B", "A"))))
result <- ifelse( x >= 90, "A", ifelse( x >= 80, "B", ifelse( x >= 70, "C", ifelse( x >= 60, "D", "F"))))
result

[1] "A"

In [ ]:
# 다중 조건문 작성시 case_when
# case_when( 조건식~참일때값, ..., TRUE~참일때값)
case_when( x <= 30 ~ "작음", x <= 60 ~ '보통', TRUE ~ '잘했음')

[1] "잘했음"

In [ ]:
case_when( x >= 90 ~ "A", x >= 80 ~ "B", x >= 70 ~ "C", x >= 60 ~ "D", TRUE ~ "F")

[1] "A"

In [ ]:
# 성적 : 수,우,미,양,가
sungjuk

  name eng mat sci tot avg
1 John 90  85  90  265 88.3
2 Tom  95  96  80  271 90.3
3 Mark 69  49  70  188 62.7
4 Jane 78  95  60  233 77.7

In [ ]:
sungjuk <- sungjuk %>% mutate( grade = case_when( avg >= 90 ~ "수", avg >= 80 ~ "우", avg >= 70 ~ "미", avg >= 60 ~ "양", TRUE ~ "가"))
sungjuk

  name eng mat sci tot avg  grade
1 John 90  85  90  265 88.3 우
2 Tom  95  96  80  271 90.3 수
3 Mark 69  49  70  188 62.7 양
4 Jane 78  95  60  233 77.7 미